# Жадібні алгоритми — це клас алгоритмів оптимізації, які у кожному кроці розв’язують підзадачу, вибираючи найкращий
# локальний варіант із надією знайти глобальний оптимум.

# Ось основні три принципи жадібних алгоритмів:
# 1. Локальний оптимум. На кожному кроці алгоритм вибирає найкращий локальний варіант.
# 2. Прогрес. Жадібний алгоритм постійно рухається вперед, роблячи найкращий вибір на кожному кроці.
# 3. Незворотність. Після кожного кроку вибір фіксується і не може бути вже скасований.

# Ось основні кроки, які зазвичай включаються в жадібний алгоритм:
# 1. Ініціалізація: Визначте початковий стан.
# 2. Вибір: На кожному кроці виберіть найкращий локальний варіант.
# 3. Перевірка: Перевірте, чи ви досягли кінцевого стану. Якщо так, алгоритм завершено.
# 4. Оновлення: Оновіть стан на основі вибору, зробленого на попередньому кроці.
# 5. Повторення: Поверніться до кроку 2, поки не досягнете кінцевого стану.

