def naive_search(main_string, pattern):
    M = len(pattern)
    N = len(main_string)

    # Перебір по символах головного рядка
    for i in range(N - M + 1):
        j = 0

        # Перебір по символах підрядка
        while j < M:
            if main_string[i + j] != pattern[j]:
                break
            j += 1

        # Якщо значення j дорівнює довжині підрядка, то підрядок знайдено
        if j == M:
            return i

    return -1


main_string = "ABABDABACDABABCABAB"
pattern = "ABABCABAB"
position = naive_search(main_string, pattern)

if position != -1:
    print(f"Підрядок знайдено на позиції {position}")
else:
    print("Підрядок не знайдено в головному рядку.")

# Наївний алгоритм пошуку підрядка в рядку — це один з найпростіших способів знаходження підрядка в головному рядку. Він полягає в послідовному порівнянні підрядка з кожним відрізком головного рядка.
# Основний принцип алгоритму — це порівняння кожного символу головного рядка з першим символом шаблону. Якщо вони збігаються, необхідно порівняти наступні символи до кінця шаблону.


# Складність O(n×m), де n — довжина головного рядка, а m — довжина підрядка.
#
# Втім, якщо ми розглядаємо ситуацію, де довжина підрядка M наближається до довжини головного рядка N,
# то складність може бути представлена вже як O(n^2).
# Це робить алгоритм неефективним для довгих рядків.
